# SetCurves Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarFreeFormAccessor..::..SetCurves Method
RebarFreeFormAccessor Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SetCurves(IList<(Of <<'(IList<(Of <<'(Curve>)>>)>)>>)) | Set the curves into a free form Rebar. Will throw exception if the rebar has valid constraints. |
| SetCurves(IList<(Of <<'(CurveLoop>)>>)) | Set the curves into a free form Rebar. Will throw exception if the rebar has valid constraints. |

# See Also
RebarFreeFormAccessor Class
RebarFreeFormAccessor Members
Autodesk.Revit.DB.Structure Namespace